org/fgem.tex
% Created 2020-04-28 Tue 10:09
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Nicholas Knoblauch}
\date{\today}
\title{Functional Enrichment by Expectation Maximization Project}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents


\section*{{\bfseries\sffamily TODO} FGEM Project [0\%]}
\label{sec:org1508fb7}
\subsection*{{\bfseries\sffamily TODO} Write Paper [0\%]}
\label{sec:org732d8ff}
\begin{itemize}
\item Target submission to Bioinformatics
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} Introduction}
\label{sec:org9984d46}
\subsubsection*{{\bfseries\sffamily TODO} Statistical Method}
\label{sec:org4643e9f}
\subsubsection*{{\bfseries\sffamily TODO} Application to Autism}
\label{sec:org4440a86}
\subsubsection*{{\bfseries\sffamily TODO} Software}
\label{sec:org7f2702f}
\subsubsection*{{\bfseries\sffamily TODO} Results}
\label{sec:orgae495ef}
\subsubsection*{{\bfseries\sffamily TODO} Discussion}
\label{sec:orgdb2d859}
\subsection*{{\bfseries\sffamily TODO} Analyses [0\%]}
\label{sec:orgf75d1fe}
\subsubsection*{{\bfseries\sffamily TODO} Run FGEM on new set of genes}
\label{sec:org49ed5db}
From \cite{satterstrom}
\subsubsection*{{\bfseries\sffamily TODO} Characterize extent of collinearity issue}
\label{sec:org27d105a}
\subsection*{{\bfseries\sffamily TODO} Code [66\%]}
\label{sec:org1d6eb4c}
\subsubsection*{{\bfseries\sffamily DONE} Write Vignette}
\label{sec:org3ceb1fa}
\subsubsection*{{\bfseries\sffamily DONE} Write R package}
\label{sec:org802189f}
\subsubsection*{{\bfseries\sffamily TODO} Submit to CRAN (or Bioconductor)}
\label{sec:org98dad4f}
\end{document}